// 自動生成的權重配置
export const optionWeights = {
    "1a": {
        "弹性": 2,
        "串商": 2,
        "逆反": 2,
        "锐气": 1
    },
    "1b": {
        "弹性": 1,
        "串商": 2,
        "逆反": 2
    },
    "1c": {
        "弹性": -2,
        "锐气": 2,
        "本命執着": 2
    },
    "1d": {
        "弹性": -1,
        "串商": 1,
        "理智": -1,
        "攻击性": 2,
        "锐气": 2,
        "本命執着": 1
    },
    "2a": {
        "弹性": -1,
        "理智": -1,
        "攻击性": 2,
        "逆反": 1,
        "锐气": 2
    },
    "2b": {
        "弹性": 2,
        "理智": 1,
        "锐气": 1
    },
    "2c": {
        "弹性": -1,
        "理智": -2,
        "攻击性": -2,
        "逆反": -2,
        "锐气": -1,
        "本命執着": 2
    },
    "2d": {
        "弹性": -1,
        "攻击性": -1,
        "逆反": -2,
        "锐气": -2,
        "本命執着": 1
    },
    "3a": {
        "弹性": 1,
        "攻击性": -1,
        "本命執着": 1
    },
    "3b": {
        "弹性": -1,
        "理智": -1,
        "攻击性": 1,
        "逆反": 2,
        "锐气": 2,
        "本命執着": 2
    },
    "3c": {
        "弹性": -2,
        "串商": 1,
        "理智": -2,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "本命執着": 2
    },
    "3d": {
        "弹性": 2,
        "串商": 2
    },
    "4a": {
        "逆反": -1,
        "服从性": 2
    },
    "4b": {
        "串商": 2
    },
    "4c": {
        "串商": 2,
        "理智": 2,
        "锐气": 2,
        "服从性": -5
    },
    "4d": {
        "理智": 1,
        "攻击性": 1,
        "逆反": 2,
        "锐气": 2,
        "服从性": -2
    },
    "5a": {
        "弹性": 2,
        "串商": 1,
        "理智": 2,
        "逆反": -1
    },
    "5b": {
        "串商": 1,
        "理智": -1,
        "攻击性": 2,
        "逆反": 1,
        "锐气": 2,
        "本命執着": 2,
        "服从性": -2
    },
    "5c": {
        "攻击性": 1,
        "本命執着": 1,
        "服从性": -1
    },
    "5d": {
        "弹性": 1,
        "串商": 2,
        "理智": 1,
        "攻击性": 2,
        "逆反": 1,
        "锐气": 1
    },
    "6a": {
        "理智": -1,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2
    },
    "6b": {
        "攻击性": 1,
        "锐气": 1
    },
    "6c": {
        "理智": 1
    },
    "6d": {
        "攻击性": 1,
        "逆反": 2,
        "锐气": 2
    },
    "7a": {
        "本命執着": 2
    },
    "7b": {
        "本命執着": 2
    },
    "7c": {
        "理智": 2,
        "攻击性": 1,
        "锐气": 1
    },
    "7d": {},
    "8a": {
        "串商": -2,
        "攻击性": -2
    },
    "8b": {
        "串商": 1
    },
    "8c": {
        "串商": 2,
        "攻击性": 1
    },
    "8d": {
        "弹性": 1,
        "串商": 3,
        "攻击性": 2
    },
    "9a": {
        "弹性": 2,
        "串商": 1,
        "理智": 1,
        "逆反": 1
    },
    "9b": {
        "弹性": 2,
        "串商": 2,
        "理智": 1,
        "攻击性": 1,
        "逆反": 2,
        "锐气": 1,
        "面具人格": 1
    },
    "9c": {
        "弹性": -2,
        "理智": -2,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "9d": {
        "串商": -2,
        "攻击性": -2,
        "逆反": -2,
        "锐气": -2,
        "面具人格": 2
    },
    "10a": {
        "游戏依赖度": 2
    },
    "10b": {
        "游戏依赖度": 2
    },
    "10c": {
        "本命執着": 1,
        "游戏依赖度": 2
    },
    "10d": {
        "不可说": 2
    },
    "11a": {
        "理智": 2,
        "攻击性": -1,
        "面具人格": 1,
        "服从性": 2
    },
    "11b": {
        "理智": 2,
        "不可说": 2
    },
    "11c": {
        "弹性": -2,
        "理智": 2,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2,
        "服从性": -2
    },
    "11d": {
        "弹性": 1,
        "串商": 1,
        "理智": 1,
        "攻击性": 1,
        "服从性": -1
    },
    "12a": {
        "攻击性": -2,
        "逆反": -1,
        "锐气": 1,
        "决策风格": -1,
        "面具人格": 1,
        "服从性": 1
    },
    "12b": {
        "理智": 1,
        "攻击性": -1,
        "逆反": -1,
        "锐气": -1
    },
    "12c": {
        "理智": 2,
        "攻击性": 2,
        "逆反": 0,
        "锐气": 2,
        "决策风格": 2,
        "面具人格": -1
    },
    "12d": {
        "弹性": 1,
        "理智": 1,
        "面具人格": 2
    },
    "13a": {
        "攻击性": -2,
        "逆反": -2,
        "锐气": -2,
        "决策风格": -3,
        "面具人格": 3
    },
    "13b": {
        "攻击性": 1,
        "逆反": 1,
        "锐气": 1,
        "决策风格": 1
    },
    "13c": {
        "理智": 2,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "本命執着": 1,
        "决策风格": 2,
        "面具人格": -1
    },
    "13d": {
        "理智": -1,
        "决策风格": -2,
        "面具人格": 1
    },
    "14a": {
        "决策风格": -2
    },
    "14b": {
        "本命執着": 1,
        "面具人格": 1
    },
    "14c": {
        "理智": 1,
        "攻击性": 1,
        "本命執着": 1
    },
    "14d": {},
    "15a": {
        "理智": 1,
        "决策风格": 1,
        "不可说": 2
    },
    "15b": {
        "理智": 2,
        "决策风格": 1,
        "不可说": 2
    },
    "15c": {
        "理智": 1,
        "决策风格": 1,
        "不可说": 1
    },
    "15d": {
        "理智": 1,
        "决策风格": 1,
        "不可说": 1
    },
    "16a": {
        "不可说": 2,
        "面具人格": -1
    },
    "16b": {
        "不可说": 1,
        "面具人格": 2
    },
    "16c": {
        "不可说": 2,
        "面具人格": -2
    },
    "16d": {
        "不可说": 5,
        "面具人格": -2
    },
    "17a": {
        "理智": -1,
        "逆反": 1,
        "锐气": 1,
        "决策风格": 1
    },
    "17b": {
        "理智": 2,
        "攻击性": -1,
        "逆反": -2,
        "锐气": -2,
        "决策风格": 2,
        "面具人格": 2
    },
    "17c": {
        "攻击性": 1,
        "逆反": 2,
        "锐气": 2,
        "决策风格": -1,
        "面具人格": -1
    },
    "17d": {
        "决策风格": -2,
        "面具人格": -2
    },
    "18a": {
        "锐气": 2,
        "决策风格": 1,
        "不可说": 1
    },
    "18b": {
        "锐气": 1,
        "本命執着": 1,
        "决策风格": 2,
        "不可说": 1
    },
    "18c": {
        "锐气": 1,
        "决策风格": 3,
        "不可说": 1,
        "面具人格": 2
    },
    "18d": {
        "攻击性": -1,
        "逆反": -1,
        "锐气": -2,
        "决策风格": -1,
        "不可说": -4
    },
    "19a": {
        "串商": 1,
        "理智": -1,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "19b": {
        "串商": 1,
        "理智": -1,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "19c": {
        "理智": 1,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "19d": {
        "弹性": 1,
        "理智": 1,
        "攻击性": -1,
        "逆反": -1,
        "锐气": -2,
        "面具人格": 2
    },
    "20a": {
        "串商": 1,
        "理智": -1,
        "攻击性": 1,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "20b": {
        "串商": 1,
        "理智": -1,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "20c": {
        "理智": 1,
        "攻击性": 2,
        "逆反": 2,
        "锐气": 2,
        "面具人格": -2
    },
    "20d": {
        "弹性": 1,
        "理智": 1,
        "攻击性": -1,
        "逆反": -1,
        "锐气": -2,
        "面具人格": 2
    },
    "21a": {
        "攻击性": 2,
        "锐气": 2,
        "决策风格": 1,
        "面具人格": -1
    },
    "21b": {
        "弹性": 2,
        "锐气": -1,
        "决策风格": 1
    },
    "21c": {
        "本命執着": 6,
        "决策风格": -3
    },
    "21d": {
        "决策风格": -6,
        "不可说": 5
    },
    "22a": {},
    "22b": {},
    "23a": {
        "理智": 1,
        "逆反": 1,
        "锐气": 1,
        "本命執着": 1,
        "不可说": 1
    },
    "23b": {
        "串商": -1,
        "理智": 1,
        "逆反": 2,
        "本命執着": 2,
        "不可说": 2,
        "服从性": -1
    },
    "23c": {
        "逆反": -1,
        "不可说": 1,
        "服从性": 1
    },
    "23d": {
        "理智": 1,
        "逆反": 2,
        "锐气": 1,
        "本命執着": 2,
        "不可说": 1,
        "服从性": -2
    },
    "24a": {
        "理智": 1,
        "攻击性": 1
    },
    "24b": {
        "串商": -1,
        "理智": 2,
        "攻击性": -1,
        "逆反": 2,
        "锐气": 1,
        "本命執着": 2,
        "服从性": -2
    },
    "24c": {
        "串商": -1,
        "理智": 1,
        "攻击性": -1,
        "逆反": 2,
        "锐气": 1,
        "本命執着": 2,
        "服从性": -2
    },
    "24d": {
        "攻击性": 1,
        "锐气": -1,
        "决策风格": 2
    },
    "25a": {
        "攻击性": 2,
        "决策风格": 2,
        "不可说": 2,
        "服从性": 1
    },
    "25b": {
        "攻击性": 2,
        "决策风格": 1,
        "不可说": 1
    },
    "25c": {
        "攻击性": 2
    },
    "25d": {
        "串商": -2,
        "理智": 1,
        "攻击性": -2,
        "逆反": 1,
        "锐气": 1,
        "本命執着": 1,
        "服从性": -2
    },
    "26a": {
        "攻击性": 1,
        "游戏依赖度": -2,
        "不可说": 1,
        "服从性": 3
    },
    "26b": {
        "逆反": 1,
        "本命執着": 1,
        "游戏依赖度": 1,
        "不可说": 2
    },
    "26c": {
        "攻击性": -1,
        "逆反": 2,
        "锐气": 2,
        "本命執着": 2,
        "游戏依赖度": 2,
        "不可说": 2,
        "服从性": -2
    },
    "26d": {
        "攻击性": 1,
        "游戏依赖度": -1,
        "不可说": -1
    },
    "27a": {
        "决策风格": 1,
        "不可说": 1
    },
    "27b": {
        "决策风格": 1,
        "不可说": 1
    },
    "27c": {
        "决策风格": 2
    },
    "27d": {
        "决策风格": 1,
        "不可说": 3
    },
    "28a": {
        "理智": 2,
        "攻击性": -1,
        "逆反": 3,
        "锐气": 1,
        "本命執着": 2,
        "服从性": -2
    },
    "28b": {
        "理智": 1,
        "攻击性": -1,
        "面具人格": 2
    },
    "28c": {
        "理智": 2,
        "攻击性": -1,
        "逆反": 2,
        "本命執着": 2,
        "服从性": -2
    },
    "28d": {
        "串商": -8,
        "理智": -8,
        "服从性": 5
    },
    "29a": {},
    "29b": {},
    "29c": {},
    "29d": {
        "面具人格": 5
    },
    "30a": {
        "面具人格": 5
    },
    "30b": {
        "逆反": 2,
        "锐气": 5,
        "本命執着": 1,
        "服从性": -2
    },
    "30c": {
        "游戏依赖度": -8,
        "服从性": 2
    },
    "30d": {
        "服从性": 2
    }
};