
export const questions = [
    {
        id: "q1",
        text: "美好的周六下午，你在细品IVL这个区王争霸赛。你的主队20s倒地，bm立马开串，你的反应是？",
        options: [
            { id: "1a", letter: "A", text: "爱串就串，bm才是老大！" },
            { id: "1b", letter: "B", text: "串是可以的，不串也是可以的，群友开团我秒跟" },
            { id: "1c", letter: "C", text: "禁言bm, 别动我心肝。" },
            { id: "1d", letter: "D", text: "不是这大教做的啥bp啊把xx放了有意义不副屠抢资源，wb盖楼中" }
        ]
    },
    {
        id: "q2",
        text: "你的主队今天把凶签拿反了，可惜他们不认字。不负众望力战天选不敌民间队，你的反应是？",
        options: [
            { id: "2a", letter: "A", text: "wb盖楼，道歉退役跳河一条龙: 场均一点几退役你老年都没脸开播恰米，在不退役晚节不保了" },
            { id: "2b", letter: "B", text: "看笑了，心肝谁啊我不认识" },
            { id: "2c", letter: "C", text: "看哭了，主队打比赛我比他们紧张，输了依旧是心肝" },
            { id: "2d", letter: "D", text: "不敢回看，左顾右盼的暗自悲伤。太丢人了不能让别人知道这是我主队" }
        ]
    },
    {
        id: "q3",
        text: "wb有人贴脸你的主推，评论「什么时候退役」，你的反应是？",
        options: [
            { id: "3a", letter: "A", text: "无视，并鼓励主推。xx状态回暖啦！不用去管外面的流言蜚语 先冷静冷静" },
            { id: "3b", letter: "B", text: "评论：私博贴脸4000+哦[捂嘴哭]已经有好好打的心了你还要怎么样" },
            { id: "3c", letter: "C", text: "评论：你别搞笑好吗[捂嘴哭]你不来别人微博下面跳脚有人理你吗，找存在感也是不一般[doge]你纯恨就纯恨，装什么理中客" },
            { id: "3d", letter: "D", text: "无视，无感。黑子爱喷就喷，芝士食物..." }
        ]
    },
    {
        id: "q4",
        text: "bm出来玩，聊着聊着发现 大慈大悲救苦救难dls大人 居然是鸟杂，而你，作为一个无偏好串子，你决定:",
        options: [
            { id: "4a", letter: "A", text: "和dls大人一起辱骂雀人" },
            { id: "4b", letter: "B", text: "鸡公煲，鸡公煲，经过我的胃" },
            { id: "4c", letter: "C", text: "dls这什么法号啊乐子唐的没边" },
            { id: "4d", letter: "D", text: "直接和dls爆了，cos一下积杂挑衅dls，窖鸡四跑dx老奶，dls气不气?" }
        ]
    },
    {
        id: "q5",
        text: "很不巧，有一个隐藏窖鸡超话主持人和dls塔塔开了，你作为一个积粉的反应是:",
        options: [
            { id: "5a", letter: "A", text: "不撕b，不吵架，专注自己的唐氐生活" },
            { id: "5b", letter: "B", text: "和dls对线: 踏出赛场的那一刻，复仇的火焰已从心底悄然而生。正义与真相皆不重要，他已发誓要让那些不义之人付出代价。【奇珍随从】GG-“训练机”即将上线。" },
            { id: "5c", letter: "C", text: "录下来去超话等大粉攻击dls，不会引火上身的同时也出了这口恶气" },
            { id: "5d", letter: "D", text: "中如立: 是鸡公煲VS窑鸡，是录音笔vs手机，是最长的河vs最高的山，是白莲花vs纯xz，是人在做天在看vs菜就多练" }
        ]
    },
    {
        id: "q6",
        text: "你在空间发了串彩笔言论，有唯粉评论: xx直播你也是不看的吧？他也是在练的好吗？也都是在进步在改变的，你想把他骂走吗？，你決定:",
        options: [
            { id: "6a", letter: "A", text: "神经病来我空间拉屎来了，对线和他爆了" },
            { id: "6b", letter: "B", text: "哦哦这么夸张(截图转发: xxx粉丝 be like)" },
            { id: "6c", letter: "C", text: "拉黑。无需在意" },
            { id: "6d", letter: "D", text: "查成分开串他心肝，嫩肉粉多吃点，xxx看懂了" }
        ]
    },
    {
        id: "q7",
        text: "假设你有钱又有时间，你会为了心肝比赛去看 5.1 IVL(又称区王争霸赛)吗?",
        options: [
            { id: "7a", letter: "A", text: "包的啊，不然怎么叫心肝 ，我还要排签售" },
            { id: "7b", letter: "B", text: "包まれてるよ、だって『心肝』って言うんだから。(日本人心肝)" },
            { id: "7c", letter: "C", text: "花钱看一堆区? 不会为这个sb比赛花一分钱" },
            { id: "7d", letter: "D", text: "有朋友去我就去" }
        ]
    },
    {
        id: "q8",
        text: "以下名人名言你知道多少个?",
        image: "src/assets/ivl1.png",
        options: [
            { id: "8a", letter: "A", text: "莎姐没见过这个啊 (0-3)" },
            { id: "8b", letter: "B", text: "一半吧 (4-7)" },
            { id: "8c", letter: "C", text: "大部份都能看懂" },
            { id: "8d", letter: "D", text: "全看懂了 (8-11)" }
        ]
    },
    {
        id: "q9",
        text: "你地域黑的频率是?",
        options: [
            { id: "9a", letter: "A", text: "我没有地域黑，我真要开始地域黑的话战斗力不会止于这些平和的文字。" },
            { id: "9b", letter: "B", text: "作为地域黑爱好者，本人已经掌握多地方言说乡下人" },
            { id: "9c", letter: "C", text: "我是x爷，老子的资产能买你一家的狗命，小赤佬 ，我黑你需要给你一个牛吗" },
            { id: "9d", letter: "D", text: "我纯良好公民不地域黑" }
        ]
    },
    {
        id: "q10",
        text: "bm团建你会选择什么游戏？",
        options: [
            { id: "10a", letter: "A", text: "何忆卫" },
            { id: "10b", letter: "B", text: "紧张刺激的模仿者" },
            { id: "10c", letter: "C", text: "我是排位的仆人我到点一定要打开第五人格排位，无论何时何地" },
            { id: "10d", letter: "D", text: "负距离小游戏" }
        ]
    },
    {
        id: "q11",
        text: "看到群公告/@全体成员你的反应：",
        options: [
            { id: "11a", letter: "A", text: "大慈大悲救苦救难dls大人发话了" },
            { id: "11b", letter: "B", text: "你们做过爱吗?" },
            { id: "11c", letter: "C", text: "dls这个lz又搞啥?我要造反!" },
            { id: "11d", letter: "D", text: "不看，戏耍dls" }
        ]
    },
    {
        id: "q12",
        text: "打模仿者时，你作为侦探团，通常会选择哪种打法？",
        options: [
            { id: "12a", letter: "A", text: "两耳不闻窗外事，一心单走做任务" },
            { id: "12b", letter: "B", text: "找人抱团互相监督互保" },
            { id: "12c", letter: "C", text: "会议强势带队盘狼坑"},
            { id: "12d", letter: "D", text: "没信息就只报自己的路线，谁带队跟票谁走" }
        ]
    },
   {
        id: "q13",
        text: "打模仿者时，你作为狼人，通常会选择哪种打法？",
        options: [
            { id: "13a", letter: "A", text: "怂狼致歉谢谢喵" },
            { id: "13b", letter: "B", text: "自杀式袭击，能刀多少是多少" },
            { id: "13c", letter: "C", text: "盘中立，刀好人，强推人，智囊型狼人"},
            { id: "13d", letter: "D", text: "队友我真的努力了但我把你换到轨道上了"}
        ]
    },
    {
        id: "q14",
        text: "你觉得自己在bm群里是什么样的存在？",
        options: [
            { id: "14a", letter: "A", text: "什么事情都拍个照发，手机摄像头坏了就是世界末日来了，就差拉的屎不拍一下" },
            { id: "14b", letter: "B", text: "比较精品的发一下，出门顺手发个自拍，洗眼睛！洗眼睛！洗眼睛！啊！舒服了！舒服了！舒服了！" },
            { id: "14c", letter: "C", text: "几乎不发拍的照片，自拍也是特效就是我本人，发各种截图更多。职业特权？（截图）" },
            { id: "14d", letter: "D", text: "手机摄像头故障般的发照片频率，内存友好式打法" }
        ]
    },
    {
        id: "q15",
        text: "如果路过一家b毛美容院，新店开业咨询，你会走进去吗？",
        options: [
            { id: "15a", letter: "A", text: "会，b毛和头发一样需要保养，大大方方的" },
            { id: "15b", letter: "B", text: "会，因为我会用b毛打泡泡" },
            { id: "15c", letter: "C", text: "不会，我的b只有我能碰，我害羞" },
            { id: "15d", letter: "D", text: "不会，我没有毛，只能美b" }
        ]
    },
    {
        id: "q16",
        text: "走进去发现给b毛美容的是你苦大深仇的仇人，而你已经躺下来脱光了，此刻你会选择:",
        options: [
            { id: "16a", letter: "A", text: "提起裤子就跑，卧槽不要碰我的b" },
            { id: "16b", letter: "B", text: "裤子都脱了不好意思说话也不好意思跑，疯狂给自己心理暗示没事的没事的她不会对我的b下手的，在尴尬和沉默中坦诚相见了" },
            { id: "16c", letter: "C", text: "要求对方也脱光了给自己做b毛美容" },
            { id: "16d", letter: "D", text: "对方碰一下就开始故意银角，谋士以身入局" }
        ]
    },
    {
        id: "q17",
        text: "你是一家b毛美容院的美容师，这天你照做b毛美容手术，而你发现躺在手术床上脱光了等着你手术的是你苦大深仇的仇人，她似乎已经发现你认出她了，此时你选择:",
        options: [
            { id: "17a", letter: "A", text: "扭头就走这单不接了，卧槽不好我的眼睛我要看bm生长痛洗眼睛(dls专属:看alf洗眼睛)" },
            { id: "17b", letter: "B", text: "秉承着顾客就是上帝的原则，沉默着接下了这一单，正常按流程做完" },
            { id: "17c", letter: "C", text: "好巧啊，开始搭话，点评对方的身材，给他的b毛修一个形狀" },
            { id: "17d", letter: "D", text: "凭借自己优秀的手活，趁人之危给对方来了一发扣得仇人银角，onlyfans你没入住是他的损失" }
        ]
    },
    {
        id: "q18",
        text: "你手工活的次数是:",
        options: [
            { id: "18a", letter: "A", text: "太多了，​你会记得自己吃过多少片面包吗？" },
            { id: "18b", letter: "B", text: "不撸但是摸b睡觉，b暖暖的很安心" },
            { id: "18c", letter: "C", text: "太操蛋了我的人生把我操的欲望全无" },
            { id: "18d", letter: "D", text: "哥哥姐姐们你们在说什么呀" }
        ]
    },
    {
        id: "q19",
        text: "打第五人格时，你的态度是:(rxz)",
        options: [
            { id: "19a", letter: "A", text: "队友活全家型: 死亡笔记记起来你爹卖那么多生出你个不黏锅" },
            { id: "19b", letter: "B", text: "网易活全家型: 这对面开了吧我操扫马了力战天选怎么打" },
            { id: "19c", letter: "C", text: "屠勾活全家型: 鱼勾电勾丑勾守勾轮勾鹿勾昆勾台勾全死了" },
            { id: "19d", letter: "D", text: "操。我一个人的悲伤没人能懂" }
        ]
    },
    {
        id: "q20",
        text: "打第五人格时，你的态度是:(txz)",
        options: [
            { id: "20a", letter: "A", text: "好秀啊型: 手法牛勾偶勾棍勾电勾勾锋甚勾弓勾墓勾好秀啊" },
            { id: "20b", letter: "B", text: "网易活全家型: 这判定我操扫马了力战天选怎么打" },
            { id: "20c ", letter: "C", text: "zyn烈性型: ***************长难句输出" },
            { id: "20d", letter: "D", text: "操。我一个人的悲伤没人能懂" }
        ]
    },
	{
        id: "q21",
        text: "你对第五人格(不算模仿者)主要态度是:",
        options: [
            { id: "21a", letter: "A", text: "競技遊戏，能讓我上号的只有排位和單練" },
            { id: "21b", letter: "B", text: "佛系游戏，不追求胜率不沖段，单排战士" },
            { id: "21c ", letter: "C", text: "奇蹟暖暖，我推好萌別說黑稱我雷xx" },
            { id: "21d", letter: "D", text: "cpdd,10年江西1s,找血仆" }
        ]
    },
	{
        id: "q22",
        text: "你玩明日方舟吗? (请如实回答，题不一样)",
        options: [
            { id: "22a", letter: "A", text: "玩" ,nextId: "q23"},
            { id: "22b", letter: "B", text: "不玩" ,nextId: "q28"},
        ]
    },	
	{
        id: "q23",
        text: "又是一个美好的早上，你偶然看到了这样一条评论:「我请问了这个合约榜有什么价值？ 高手不用看，根据实际情况取舍使用干员；新手看了没用，刻俄柏和ew选谁根本没有悬念。这个榜的存在就是很不合理的。」，你的想法是？",
        options: [
            { id: "23a", letter: "A", text: "哦哦，这么夸张"}, 
            { id: "23b", letter: "B", text: "臭中杯我练他干嘛?强度才能说明一切好吧，你ew打水月近地悬浮啊?" },
            { id: "23c", letter: "C", text: "合约榜就是个摆设，日常挂机就行，我没有追求" },
            { id: "23d", letter: "D", text: "唐的没边了，像那种刚过n6便发表肉鸽运气大于一切的言论的人" }
        ]
    },
	{
        id: "q24",
        text: "又是一个美好的下午，你的群友捉了玛恩纳攻破了n18界园超大蛋5结局，在群内大肆宣扬玛宝神教，你的想法是:",
        options: [
            { id: "24a", letter: "A", text: "都快进中坚了还能在一群神仙的围攻下赖着不死，哪天彻底入土也算风光大葬了" }, 
            { id: "24b", letter: "B", text: "纯爱恨，想踩头，哪个弱看哪个，日常挂机第一，日常决战第二，肉鸽第三，合约第四，不能挂机闹麻了中杯玛头" },
            { id: "24c", letter: "C", text: "纯纯宗教干员，网络是我的保护色，直接嘲讽拉满和我ew说去吧" },
            { id: "24d", letter: "D", text: "玛头真神了，萨卡兹第一近卫，玛恩纳真神了" }
        ]
    },
    {
        id: "q25",
        text: "又是一个美好的晚上，你的群友在讨论xp>>>杯级，你的想法是:",
        options: [
            { id: "25a", letter: "A", text: "xp才是这个游戏的意义，就算肉鸽日常xp不强也会捉他" },
            { id: "25b", letter: "B", text: "xp角色拉满级，但肉鸽还是优先抓超大杯，希望不够用" },
            { id: "25c", letter: "C", text: "我的xp就是轮椅干员，他可以不是超大杯但必须轮椅/挂机，横扫日常图" },
            { id: "25d", letter: "D", text: "乐子，我的xp就是杯级评估，小于超大杯中的去当仓管，我不需要菜b" }
        ]
    },
    {
        id: "q26",
        text: "又是一个美好的凌晨，你睡前想来一把美妙的萨卡兹，你的选择是:",
        options: [
            { id: "26a", letter: "A", text: "n9以下1结局水水算了，公式化蓝图美愿开刷，打个游戏没必要追求高难" },
            { id: "26b", letter: "B", text: "245魂灵死仇，n12紧急卡兹瀑布神出鬼没随便戏耍" },
            { id: "26c", letter: "C", text: "n15以上，老登都是抓滚动先祖的，你太没发育了看我来，超大蛋奎隆公式化无漏" },
            { id: "26d", letter: "D", text: "呃，肉鸽是什么?我科技树没点完" }
        ]
    },
    {
        id: "q27",
        text: "又是一个美好的周末，你的群友在讨论「明日方舟的快乐来源是集，日常图不够刺激，合约也水水」，你的想法是:",
        options: [
            { id: "27a", letter: "A", text: "玩舟主要乐趣来于集成战略胡局" },
            { id: "27b", letter: "B", text: "玩舟可以合约冲个小高难发空间装逼" },
            { id: "27c", letter: "C", text: "我不知道啊我单纯是老登离不开这款游戏了" },
            { id: "27d", letter: "D", text: "唉，卫" }
        ]
    },
    {
        id: "q28",
        text: "以下评论你最有可能发出的是哪一条?",
        options: [
            { id: "28a", letter: "A", text: "脑子连直肠上了还是眼睛被当屁眼操了，帖子写的你一点没看你个猪脑子" },
            { id: "28b", letter: "B", text: "我不会再期待纯爱了 这世界全是牛逼的碰撞" },
            { id: "28c", letter: "C", text: "你妈复活了棺材盖一露头就被警戒塔和炮兵锁了，懒的喷" },
            { id: "28d", letter: "D", text: "我讨厌你。" }
        ]
    },
    {
        id: "q29",
        text: "你觉得群里精华里最精华的是哪一条?",
        image: "src/assets/jh.png",
        options: [
            { id: "29a", letter: "A", text: "jh规则怪谈" },
            { id: "29b", letter: "B", text: "bm倒贴榜" },
            { id: "29c", letter: "C", text: "你们难道上学没有那种老师上课对答案，然后答案是0.5，然后有人举手问那我写1/2行不行的人？" },
            { id: "29d", letter: "D", text: "wwwwjbjbwwwwwwww" }
        ]
    },
    {
        id: "q30",
        text: "如果你要使用黑色的错误软件，你最有可能的用途是?",
        options: [
            { id: "30a", letter: "A", text: "看低俗小视频，有万达广场附近的吗，每日大赛" },
            { id: "30b", letter: "B", text: "我是见证逼" },
            { id: "30c", letter: "C", text: "我是qq邮箱用户" },
            { id: "30d", letter: "D", text: "你在说啥" }
        ]
    }
];